<template>
  <div class="mb-[30px]">
    <h1 class="text-[55px]">Ән сатып алу</h1>
    <p class="text-[17px] pt-[15px] text-gray-500">
      Music әртістерге белгілі авторлардың, композиторлардың, аранжировщиктердің
      және дыбыстық продюсерлердің коллекцияларынан репертуарына ән сатып алуды
      ұсынады. Сайтта тек қана заңды контент ұсынылған, сатып алынған тректерге
      құқықтар Қазақстан заңнамасына толық сәйкес ресімделеді.
    </p>
    <p>
      Барлық төлемдер қауіпсіз мәміле қағидаты бойынша Kaspi BANK көмегімен
      жүзеге асырылады: сатып алушы сатып алынған материалды алғаннан кейін ғана
      сатып алушының картасынан ақшалай қаражат авторға аударылады
    </p>
    <h1 class="text-[25px] text-blue-700">Қалай сатып алуға болады</h1>
    <ol class="ps-5 mt-2 space-y-1 list-decimal list-inside">
      <p>
        Барлық келісімшарттар автор мен сатып алушы арасында автоматты түрде
        жасалады.
      </p>
    </ol>
    <h1 class="text-[25px] text-blue-700">
      Эксклюзивті емес лицензияны сатып алу ( қайта пайдалануға болатын)
    </h1>
    <ul class="ps-5 mt-2 space-y-1 list-disc list-inside">
      <li>
        Төлем жасамас бұрын құқықтарды беру туралы келісім-шарт нысанын толтыру
        қажет: нысан төлем алдында тікелей қол жетімді болады. Төлегеннен кейін
        бірден барлық материалды Почтага жүктеуге болады.
      </li>
    </ul>
    <h1 class="text-[25px] text-blue-700">
      Айрықша лицензияны сатып алу (эксклюзив)
    </h1>
    <p>
      Перед оплатой необходимо заполнить форму для договора о передаче прав:
      форма будет доступна непосредственно перед оплатой. Стоимость покупки
      списывается с вашей карты, но денежные средства остаются замороженными в
      платежной системе до получения вами скана подписанного договора от автора.
    </p>
  </div>
</template>

<script>
export default {};
</script>

<style lang="scss" scoped>
p {
  font-size: 17px;
  padding-top: 15px;
}
h1 {
  padding-top: 30px;
}
</style>
