<template>
  <div class="mb-[30px] bg-[#EEF3F7] p-[30px] rounded-[25px]">
    <h1 class="text-[55px]">Бит сату</h1>
    <p class="text-[17px] pt-[15px] text-gray-500">
      Music жобасымен сіз өз шығармаңыздың әнін тиімді және заңды түрде сата
      аласыз және өз шығармашылығыңызды қазақ шоу-бизнесінің ең жарқын
      жұлдыздарына жеткізе аласыз. Біз Қазақстанның авторлық құқық саласындағы
      заңнамасына толық сәйкес сатуды ресімдеуге кепілдік береміз.
    </p>
    <p>
      Бізде музыканы сату өте оңай. <br />
      Ол үшін тек үш қадам жасау керек:
    </p>
    <ol class="ps-5 mt-2 space-y-1 list-decimal list-inside">
      <li>Тіркеліңіз, ұсынылған профильде авторды таңдаңыз.</li>
      <li>
        Профиліңізді өте мұқият толтырыңыз: профильдегі деректер сатып алушымен
        келісімде көрсетіледі.
      </li>
      <li>Материалды жүктеп, модерациядан өтіңіз.</li>
    </ol>
    <h1 class="text-[25px] text-blue-700">Материалға қойылатын талаптар:</h1>
    <ol class="ps-5 mt-2 space-y-1 list-decimal list-inside">
      <li>
        Біз зорлық-зомбылық, есірткі қолдану немесе басқа адамдарды қорлауды
        қамтитын діни, саяси сипаттағы материалды қабылдамаймыз.
      </li>
      <li>
        Біз диктофонда, гитарада, кесілген тректерде айтылатын демонстрацияларды
        қарастырмаймыз. Басқа адамдардың шығармаларына ремикстер. Немесе жай
        ескірген, маңызды емес материал.
      </li>
      <li>Біз шансон және ауыр рок жанрындағы әнді қарастырмаймыз.</li>
      <li>
        Егер трек әлдеқашан шығарылған болса (яғни, шығарылым болды және оны
        музыкалық қызметтерде тыңдауға болады), біз оны да қарастырмаймыз. Трек
        сапалы және түпнұсқа болуы керек.
      </li>
    </ol>
    <h1 class="text-[25px] text-blue-700">
      Әнді сатқан кезде сізден файлдар қажет болады:
    </h1>
    <ul class="ps-5 mt-2 space-y-1 list-disc list-inside">
      <li>Плюс мр3;</li>
      <li>Минус wav;</li>
      <li>Әннің мәтіні;</li>
    </ul>
    <h1 class="text-[25px] text-blue-700">
      Біз әлемнің түкпір-түкпірінен келген авторлармен жұмыс істейміз.
    </h1>
    <p>
      Гонорар төлемдеріне әлемнің кез келген банкінің және төлем жүйелерінің -
      Visa немесе MasterCard карталары ғана қабылданады, әмияндар және өзге
      төлем жүйелері төлем үшін қабылданбайды. Роялти төлеу үшін карта Жеке
      кабинетте бекітіледі. Барлық транзакциялар "Тинькофф Банк" АҚ арқылы
      жүзеге асырылады.
    </p>
    <h1 class="text-[25px] text-blue-700">Сату қалай жүреді:</h1>
    <ol class="ps-5 mt-2 space-y-1 list-decimal list-inside">
      <li>
        лицензия бойынша сату (қайта пайдалануға болатын). Сіз өзіңіздің
        картаңызға қолма-қол ақшаны автоматты түрде аласыз, оны өз кабинетіңізге
        байлап қойғаннан кейін. Төлем 1-2 жұмыс күні ішінде есептеледі.
      </li>
      <li>
        Айрықша лицензия бойынша сату (эксклюзив). Сатып алушы төлем жасайды,
        қолма-қол ақша қатып қалады. Жеке кабинет арқылы сіз трек төленгені
        туралы ескерту аласыз (поштаға көшіріледі). Осыдан кейін сіз өзіңіздің
        кабинетіңізге, бөлімге кіруіңіз керек - ағымдағы мәмілелер, сатып
        алушымен келісімшартты жүктеп алыңыз және басып шығарыңыз, қол қойыңыз,
        сапалы сканерлеңіз және бөлімге жүктеңіз-ағымдағы мәмілелер.
      </li>
    </ol>
  </div>
</template>

<script>
export default {};
</script>

<style lang="scss" scoped>
p {
  font-size: 17px;
  padding-top: 15px;
}
h1 {
  padding-top: 30px;
}
</style>
